Channel/2D/R0180-coarse/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application        simpleFoam;

startFrom          startTime;

startTime          0;

stopAt             endTime; // writeNow;

endTime            1;

deltaT             1;

writeControl       timeStep;

writeInterval      1;

purgeWrite         0;

writeFormat        ascii;

writePricision     12;

writeCompression   off;

timeFormat         general;

timePrecision      6;
 
runTimeModifiable  true;

functions
{
	#includeFunc grad(p)
	#includeFunc grad(U)
	#includeFunc grad(k)
	#includeFunc R
}

/*****************************************************************************/
