Channel/2D/R0180-coarse/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

Lx		0.5;
Ly		1;

vertices
(
	(0    0  0)
	($Lx  0  0)
	($Lx  1  0)
	(0    1  0)
	(0    0  1)
	($Lx  0  1)
	($Lx  1  1)
	(0    1  1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) 
	(10 32 1) 
	simpleGrading (1 82.501191 1)
);

edges
(
);

boundary
(
	INLET
	{
		type			cyclic;
		neighbourPatch  OUTLET;
		faces
		(
			(0 4 7 3)
		);
	}
	
	OUTLET
	{
		type			cyclic;
		neighbourPatch  INLET;
		faces
		(
			(1 2 6 5)
		);
	}

	WALL
	{
		type			wall;
		faces
		(
			(0 1 5 4)
		);
	}

	CENTER
	{
		type			symmetryPlane;
		faces
		(
			(3 7 6 2)
		);
	}

	frontAndBackPlanes
	{
		type			empty;
		faces
		(
			(0 3 2 1)
			(4 5 6 7)
		);
	}

);

mergePatchPairs
(
);

// ************************************************************************* //
