Channel/2D/R0180-coarse/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    INLET
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          32;
        startFace       598;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  OUTLET;
    }
    OUTLET
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          32;
        startFace       630;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  INLET;
    }
    WALL
    {
        type            wall;
        inGroups        1(wall);
        nFaces          10;
        startFace       662;
    }
    CENTER
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          10;
        startFace       672;
    }
    frontAndBackPlanes
    {
        type            empty;
        inGroups        1(empty);
        nFaces          640;
        startFace       682;
    }
)

// ************************************************************************* //
