Channel/2D/R0180-coarse/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "10000";
    object      U_DNS;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   nonuniform List<vector> 
320
(
(0.00942651 0 1.21449e-06)
(0.00942651 0 1.21449e-06)
(0.00942651 0 1.21449e-06)
(0.00942651 0 1.21449e-06)
(0.00942651 0 1.21449e-06)
(0.00942651 0 1.21449e-06)
(0.00942651 0 1.21449e-06)
(0.00942651 0 1.21449e-06)
...
)
;

boundaryField
{
    INLET
    {
        type            cyclic;
    }
    OUTLET
    {
        type            cyclic;
    }
    WALL
    {
        type            noSlip;
    }
    CENTER
    {
        type            symmetryPlane;
    }
    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
