Channel/2D/R0180-coarse/0/RS_DNS
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "10000";
    object      RS_DNS;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];


internalField   nonuniform List<symmTensor> 
320
(
(1.31154e-05 -1.22971e-08 -2.21734e-09 2.12735e-10 8.62412e-12 3.75411e-06)
(1.31154e-05 -1.22971e-08 -2.21734e-09 2.12735e-10 8.62412e-12 3.75411e-06)
(1.31154e-05 -1.22971e-08 -2.21734e-09 2.12735e-10 8.62412e-12 3.75411e-06)
(1.31154e-05 -1.22971e-08 -2.21734e-09 2.12735e-10 8.62412e-12 3.75411e-06)
(1.31154e-05 -1.22971e-08 -2.21734e-09 2.12735e-10 8.62412e-12 3.75411e-06)
(1.31154e-05 -1.22971e-08 -2.21734e-09 2.12735e-10 8.62412e-12 3.75411e-06)
(1.31154e-05 -1.22971e-08 -2.21734e-09 2.12735e-10 8.62412e-12 3.75411e-06)
(1.31154e-05 -1.22971e-08 -2.21734e-09 2.12735e-10 8.62412e-12 3.75411e-06)
...
)
;

boundaryField
{
    INLET
    {
        type            cyclic;
    }
    OUTLET
    {
        type            cyclic;
    }
    WALL
    {
        type            fixedValue;
        value           uniform (6.66667e-11 0 0 6.66667e-11 0 6.66667e-11);
    }
    CENTER
    {
        type            symmetryPlane;
    }
    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
