Channel/2D/R0180-coarse/0/divRS_DNS
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "10000";
    object      divRS_DNS;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -2 0 0 0 0];


internalField   nonuniform List<vector> 
320
(
(-9.79341e-05 4.07342e-06 6.64049e-08)
(-9.79341e-05 4.07342e-06 6.64049e-08)
(-9.79341e-05 4.07342e-06 6.64049e-08)
(-9.79341e-05 4.07342e-06 6.64049e-08)
(-9.79341e-05 4.07342e-06 6.64049e-08)
(-9.79341e-05 4.07342e-06 6.64049e-08)
(-9.79341e-05 4.07342e-06 6.64049e-08)
(-9.79341e-05 4.07342e-06 6.64049e-08)
...
)
;

boundaryField
{
    INLET
    {
        type            cyclic;
    }
    OUTLET
    {
        type            cyclic;
    }
    WALL
    {
        type            extrapolatedCalculated;
        value           nonuniform List<vector> 10((-9.79341e-05 4.07342e-06 6.64049e-08) (-9.79341e-05 4.07342e-06 6.64049e-08) (-9.79341e-05 4.07342e-06 6.64049e-08) (-9.79341e-05 4.07342e-06 6.64049e-08) (-9.79341e-05 4.07342e-06 6.64049e-08) (-9.79341e-05 4.07342e-06 6.64049e-08) (-9.79341e-05 4.07342e-06 6.64049e-08) (-9.79341e-05 4.07342e-06 6.64049e-08) (-9.79341e-05 4.07342e-06 6.64049e-08) (-9.79341e-05 4.07342e-06 6.64049e-08));
    }
    CENTER
    {
        type            symmetryPlane;
    }
    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
