Channel/2D/R0180-coarse/system/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

momentumSource
{
    type            patchMeanVelocityForce;
	activate		yes;

	patchMeanVelocityForceCoeffs
	{
		selectionMode	all;

		fields			(U);
		Ubar            (1.0 0 0);
		patch			INLET;
		relaxation      0.2;
	}
}


// ************************************************************************* //
