Channel/2D/R0180-coarse/Allrun
#! /bin/bash
# nohup mpirun -np 8 simpleFoam -parallel >log_run 2>&1 &
nohup simpleFoam >log_run 2>&1 &
